app/Models/RecentActivityModel.php

    public function getRecentActivityWithUser()
    {
        $results = $this->secondDb->table('recent_activity')
        ->select('recent_activity.*, users.user_name')
        ->join('users', 'users.user_id = recent_activity.user_id', 'inner')
        ->get()
        ->getResultArray();
---
SELECT `recent_activity`.*, `users`.`user_name`
FROM `recent_activity`
INNER JOIN `users` ON `users`.`user_id` = `recent_activity`.`user_id`