app/Models/SupportRequestModel.php

    public function getSupportRequestsFromSecondDb()
    {
        // Use the second database connection to run a query
        $query = $this->secondDb->table($this->table)->get();
---
SELECT *
FROM `support_requests`